# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 260 layers, 2,572,280 parameters, 2,572,280 gradients, 6.1 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 280 layers, 21,896,248 parameters, 21,896,248 gradients, 75.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 392 layers, 26,299,704 parameters, 26,299,704 gradients, 93.8 GFLOPs
  x: [1.00, 1.50, 512] # summary: 392 layers, 58,993,368 parameters, 58,993,368 gradients, 209.5 GFLOPs

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
 # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9


# YOLO11n head
head:
  - [[2, 4, 6, 9], 1, SimFusion_4in, []] # 10
  - [-1, 1, IFM, [[64, 32]]] # 11

  - [9, 1, Conv, [512, 1, 1]] # 12
  - [[4, 6, -1], 1, SimFusion_3in, [512]] # 13
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]] # 14
  - [-1, 3, C3k2, [512, False]] # 15


  - [6, 1, Conv, [256, 1, 1]] # 16
  - [[2, 4, -1], 1, SimFusion_3in, [256]] # 17
  - [[-1, 11], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]] # 18
  - [-1, 3, C3k2, [256, False]] # 19  head N3

  - [[19, 15, 9], 1, PyramidPoolAgg, [352, 2]] # 20
  - [-1, 1, TopBasicLayer, [352, [64, 128]]] # 21

  - [[19, 16], 1, AdvPoolFusion, []] # 22
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]] # 23
  - [-1, 3, C3k2, [256, False]] # 24  head N4

  - [[-1, 12], 1, AdvPoolFusion, []] # 25
  - [[-1, 21], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]] # 26
  - [-1, 3, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[19, 24, 27], 1, Detect, [nc]] # Detect(P3, P4, P5)

