# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 + CPUBone CVPR Findings 2026 backbone replacement.
# CPUBone source paper/code:
#   Paper: https://arxiv.org/abs/2603.26425
#   Code : https://github.com/altair199797/CPUBone
#
# Innovation:
#   1. Replace the original YOLO26 C3k2 convolutional backbone with a
#      CPUBone hierarchical CPU-friendly trunk.
#   2. Export detector-ready P3/P4/P5 features.
#   3. Add a lightweight CPUBone context adapter on each feature level before
#      the YOLO26 neck, improving detection feature selectivity while keeping
#      the original YOLO26 head untouched.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# - [-1, 1, CPUBoneBackboneYOLO, [nano, [256, 512, 1024], 3, 1, True]]
#   - [-1, 1, CPUBoneBackboneYOLO, [nano, [256, 512, 1024], 3, 0, True]]

backbone:
  # args: [variant, yolo_channels, in_chans, adapter_depth, use_context_adapter]
  - [-1, 1, CPUBoneBackboneYOLO, [b0, [256, 512, 1024], 3, 1, True]] # 0: adapted [P3/8, P4/16, P5/32]
  - [0, 1, CPUBoneFeatureIndex, [0]] # 1-P3/8
  - [0, 1, CPUBoneFeatureIndex, [1]] # 2-P4/16
  - [0, 1, CPUBoneFeatureIndex, [2]] # 3-P5/32
  - [3, 1, SPPF, [1024, 5, 3, True]] # 4
  - [-1, 2, C2PSA, [1024]] # 5


head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat CPUBone P4
  - [-1, 2, C3k2, [512, True]] # 8

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat CPUBone P3
  - [-1, 2, C3k2, [256, True]] # 11 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 14 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 17 (P5/32-large)

  - [[11, 14, 17], 1, Detect, [nc]]
