# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# Progressive LiteRG-YOLO26: P2 region prior, P3/P4 directional guidance, and the native P3-P5 E2E Detect head.
nc: 80
end2end: True
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Layer indices deliberately match yolo26.yaml so all B0 backbone, neck, and Detect weights transfer by name and shape.
lite_rg:
  enabled: True
  p2_index: 2
  p3_index: 4
  p4_index: 6
  backbone_end_index: 10
  neck_p3_index: 16
  neck_p4_index: 19
  hidden_channels: 32
  directional_kernel: 9
  use_drg: True
  use_rff: True
  target_mode: soft
  progressive_region: True
  sigma_scale: 0.25
  region_bce: 1.0
  region_dice: 1.0
  region_gain: 0.5
  region_floor: 0.2

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2-P2 region-prior source
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3 DRG source
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4 DRG source
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]] # 10-P5 remains native

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # guided backbone P4
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # guided backbone P3
  - [-1, 2, C3k2, [256, True]] # 16-N3 + Lite-RFF

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 19-N4 + Lite-RFF

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 22-P5 has no direct region module

  - [[16, 19, 22], 1, Detect, [nc]] # native one-to-many + detached one-to-one heads
