# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 main6.20 + ECCV2026 S2-FracMix-inspired Neck.
# S2-FracMix paper: https://arxiv.org/abs/2606.25784

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, S2FracMixFusion, [512, 4, 0.5, 1.5]]
  - [-1, 2, S2FracMixC2f, [512, 0.50, 4, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, S2FracMixFusion, [256, 4, 0.5, 1.5]]
  - [-1, 2, S2FracMixC2f, [256, 0.50, 4, True]] # 16 P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, S2FracMixFusion, [512, 4, 0.5, 1.5]]
  - [-1, 2, S2FracMixC2f, [512, 0.50, 4, True]] # 19 P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, S2FracMixFusion, [1024, 4, 0.5, 1.5]]
  - [-1, 1, S2FracMixC2f, [1024, 0.50, 4, True]] # 22 P5/32

  - [[16, 19, 22], 1, Detect, [nc]]
