# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 + CPUBone Stable P4/P5 backbone enhancement.
# Paper: https://arxiv.org/abs/2603.26425
# Code : https://github.com/altair199797/CPUBone
#
# Purpose:
#   Stable CPUBone residual injection for small-data training. It keeps the
#   original YOLO26 backbone and adds CPUBone local/context branches with small
#   learnable LayerScale, so the model starts close to YOLO26n but can learn
#   extra P4/P5 context.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3/8
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, CPUBoneStableBlock, [1.5, 2, 2, 0.05, True]] # 7-P4/16 stable CPUBone
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]] # 9
  - [-1, 1, CPUBoneStableBlock, [1.5, 2, 1, 0.05, True]] # 10-P5/32 stable CPUBone
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 11
  - [-1, 2, C2PSA, [1024]] # 12

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]

