# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# Paper 1 composite candidate:
# YOLO26n + CPUBoneNano-P2Lite + SPDConv-style downsampling + EMA attention.
# Build-only candidate. Do not treat this as a formal model until single-module
# pilots and signal experiments justify the combination.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # args: [variant, yolo_channels, in_chans, adapter_depth, use_context_adapter]
  - [-1, 1, CPUBoneP2BackboneYOLO, [nano, [128, 256, 512, 1024], 3, 0, False]] # 0: [P2/4, P3/8, P4/16, P5/32]
  - [0, 1, CPUBoneFeatureIndex, [0]] # 1-P2/4
  - [0, 1, CPUBoneFeatureIndex, [1]] # 2-P3/8
  - [0, 1, CPUBoneFeatureIndex, [2]] # 3-P4/16
  - [0, 1, CPUBoneFeatureIndex, [3]] # 4-P5/32
  - [4, 1, SPPF, [1024, 5, 3, True]] # 5
  - [-1, 2, C2PSA, [1024]] # 6

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 9 (P4/16)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]] # 12 (P3/8)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, True]] # 15 (P2/4)

  # SPDConv-style bottom-up path: space-to-depth keeps local detail while downsampling.
  - [-1, 1, space_to_depth, [1]]
  - [-1, 1, Conv, [128, 3, 1]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]] # 19 (P3/8)

  - [-1, 1, space_to_depth, [1]]
  - [-1, 1, Conv, [256, 3, 1]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 23 (P4/16)

  - [-1, 1, space_to_depth, [1]]
  - [-1, 1, Conv, [512, 3, 1]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 27 (P5/32)
  - [-1, 1, EMA_attention, [1024]] # 28

  - [[15, 19, 23, 28], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
