# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 260 layers, 2,572,280 parameters, 2,572,280 gradients, 6.1 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 260 layers, 10,009,784 parameters, 10,009,784 gradients, 22.8 GFLOPs
  m: [0.50, 1.00, 512] # summary: 280 layers, 21,896,248 parameters, 21,896,248 gradients, 75.4 GFLOPs
  l: [1.00, 1.00, 512] # summary: 392 layers, 26,299,704 parameters, 26,299,704 gradients, 93.8 GFLOPs
  x: [1.00, 1.50, 512] # summary: 392 layers, 58,993,368 parameters, 58,993,368 gradients, 209.5 GFLOPs

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, stem, [24, 3, 2]]  # 0-P1/2
  - [-1, 2, FusedMBConv, [24, 3, 1, 1, 0]] # 1-P2/4

  - [-1, 1, FusedMBConv, [48, 3, 2, 4, 0]]
  - [-1, 3, FusedMBConv, [48, 3, 1, 4, 0]]

  - [-1, 1, FusedMBConv, [64, 3, 2, 4, 0]]
  - [-1, 3, FusedMBConv, [64, 3, 1, 4, 0]]

  - [-1, 1, PAMBConv, [128, 3, 2, 4, 0.25]]
  - [-1, 5, MBConv, [128, 3, 1, 4, 0.25]]

  - [-1, 1, MBConv, [160, 3, 2, 6, 0.25]]
  - [-1, 5, MBConv, [160, 3, 1, 6, 0.25]]

  - [-1, 1, MBConv, [256, 3, 2, 4, 0.25]]
  - [-1, 5, MBConv, [256, 3, 1, 4, 0.25]]

  - [-1, 1, SPPF, [1024, 5]] # 9

  - [-1, 2, EMA_attention, [1024]] # 10
# YOLO26n head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large)

  - [[20, 23, 26], 1, Detect, [nc]] # Detect(P3, P4, P5)
