# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 main6.20 + ECCV2026 PriorEye-inspired Backbone.
# PriorEye paper: https://arxiv.org/abs/2606.31830
# Official repo: https://github.com/ori-mrg/PriorEye

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, PriorEyeStem, [64, 3, 2, 16]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, PriorEyeC2f, [256, 0.50, 16, False]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, PriorEyeC2f, [512, 0.50, 16, False]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, PriorEyeC2f, [512, 0.50, 16, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, PriorEyeC2f, [1024, 0.50, 16, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]
  - [-1, 1, PriorEyeBlock, [1024, 0.50, 16, 0.01]] # 11 prior polishing

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]] # 17 P3/8

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]] # 20 P4/16

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 23 P5/32

  - [[17, 20, 23], 1, Detect, [nc]]
