# Ultralytics YOLO26 + RGB/IR Dual-Backbone Dynamic Gated Fusion
# Input convention: 4 channels ordered as [R, G, B, IR].
# Structure: explicit RGB backbone + explicit IR backbone, fused at P3/P4/P5.
# Detection head remains the original YOLO Detect head.

nc: 80
channels: 4
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # -------------------------- Input split --------------------------
  - [-1, 1, RGBIRSplit, []] # 0: [RGB, IR]
  - [0, 1, Index, [3, 0]] # 1: RGB image, 3 channels
  - [0, 1, Index, [1, 1]] # 2: IR image, 1 channel

  # -------------------------- RGB backbone -------------------------
  - [1, 1, Conv, [64, 3, 2]] # 3-RGB-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-RGB-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 5
  - [-1, 1, Conv, [256, 3, 2]] # 6-RGB-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 7-RGB-P3
  - [-1, 1, Conv, [512, 3, 2]] # 8-RGB-P4/16
  - [-1, 2, C3k2, [512, True]] # 9-RGB-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 10-RGB-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 12
  - [-1, 2, C2PSA, [1024]] # 13-RGB-P5

  # --------------------------- IR backbone -------------------------
  - [2, 1, Conv, [64, 3, 2]] # 14-IR-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 15-IR-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 16
  - [-1, 1, Conv, [256, 3, 2]] # 17-IR-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 18-IR-P3
  - [-1, 1, Conv, [512, 3, 2]] # 19-IR-P4/16
  - [-1, 2, C3k2, [512, True]] # 20-IR-P4
  - [-1, 1, Conv, [1024, 3, 2]] # 21-IR-P5/32
  - [-1, 2, C3k2, [1024, True]] # 22
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 23
  - [-1, 2, C2PSA, [1024]] # 24-IR-P5

  # ----------------------- P3/P4/P5 RGB-IR fusion ------------------
  - [[7, 18], 1, Concat, [1]] # 25: RGB-P3 + IR-P3
  - [-1, 1, RGBIRDynamicFusion, [512, 4, 1.0, 0.25]] # 26-Fused-P3/8
  - [[9, 20], 1, Concat, [1]] # 27: RGB-P4 + IR-P4
  - [-1, 1, RGBIRDynamicFusion, [512, 4, 1.0, 0.25]] # 28-Fused-P4/16
  - [[13, 24], 1, Concat, [1]] # 29: RGB-P5 + IR-P5
  - [-1, 1, RGBIRDynamicFusion, [1024, 4, 1.0, 0.25]] # 30-Fused-P5/32

head:
  # ----------------------- Original YOLO26 PAN/FPN -----------------
  - [30, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 28], 1, Concat, [1]] # cat fused P4
  - [-1, 2, C3k2, [512, True]] # 33

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 26], 1, Concat, [1]] # cat fused P3
  - [-1, 2, C3k2, [256, True]] # 36 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 33], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, True]] # 39 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 30], 1, Concat, [1]] # cat fused P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 42 (P5/32-large)

  - [[36, 39, 42], 1, Detect, [nc]] # Detect(P3, P4, P5)
